; 

/****************************************************************************
******  Template  ***********************************************************
*****************************************************************************
**
**    .name      :  String  -  имя сцены  -  будет выводиться перед запуском сцены
**
**    .template  :  Array<String> | Array<Object>  -  шаблон для создания DOM-дерева. 
**                      Если элемент String - создается элемент Object {'id': String}.
**          [Element] :  Object  -  конфигурация DOM элемента, совместимая с входным
**                        аргументом settings класса View(settings) (см.описание View)
**             .id      :  String  -  id DOM - должен быть УНИКАЛЬНЫМ(!) - 
**                                    используется в HTML и в views set().
**             .childs  :  Array   -  вложенные элементы - рекурсивный обход.
**
**
**     .actions  :  Object  -  пары { name: cfg<Object> }, описывающие конкретные действия,
**                        из них создаются Thread. Имена должны быть уникальны.
**                        Кроме свойств, описанных ниже, содержат конфигурацию Thread 
**                       (см. описание Thread), кроме методов(onOpen|Close|Change).
**            [Action]  :  Object  -  описание действия.
**               .type     :  String  -  тип действия, который конфигурируется и дополняется
**                                    в фабрике SceneBuilder._thFactory - все методы Thread, а
**                                    также новые типы описываются там.
**               .target   :  String  -  имя View (id DOM элемента в .template) для привязки
**                                      в Thread.target
**               .content  :  String/Array  -  ресурс для Thread.iter  -  строка для текста,
**                                             Array для анимации.
**               + остальная Thread конфигурация (см. описание Thread).
**
**
**      .flow  :   Object  -  описания последовательности действий, обязательно поле run(!), -
**                            создает уровень вложенности
**                 .run  :  основные действия на конкретном уровне вложенности
**                    - String  :  название действия - [Action] name из конфигурации actions
**                    - Array<String>  :  список параллельных действий [Action], 
**                                       создается Thread.parallel
**                    - Object  :  создает новый уровень вложенности  {run : ..., then: ...}
**                    - Array<String/Object>  -  параллельно-последовательная структура
**                 .then  :  следует по завершении основных действий .run, создается
**                           посредством Thread.then. Описание аналогично .run: String/
**                           Array<String>/Array<String/Object>/Object  
**       
**      .task  :  Object  -  информация по решению задачи
**            .answers  :  Object  -  пары answer/response, где answer<String> передается из поля ввода,
**                                    а response<String/Object> может содержать либо строку со ссылкой 
**                                    на следующую сцену, либо поток .flow к выполнению. Сам поток выполнения
**                                    может содержать поле .link (только на самом верхнем уровне(!), или же нет,
**                                    тогда сцена останется активной. Если задан response "default" - будет
**                                    вызываться для любого answer, response на который не задан.
**/
 
var SCENES = (function(){
    var scenes = [];
    
    scenes.push({
                 name: 'Подъемник',
                 
                 template: [
                   {id: 'anima', element: 'aside', 
                      css: {
                       'white-space': 'pre'
                       }
                   },
                   {id: 'story', element: 'header'},
                   {id: 'task', element: 'footer',
                       css: {'margin-top': '2em'}
                   }
                 ],
                 
                 actions: {
                   intro: {
                      type: 'TEXT',
                      target: 'story',
                      interval: 20,
                      content: 'С подъемника видна долина, холодный горный ветер обжигает кожу. Сверху, из облаков,\
                       пробивается край древней каменной платформы. Именно в заросли лиан над ним уходит маршрутный трос.\n\
                       Нужно запустить подъемник.\n Рычаг  управления не поддается, кажется он заблокирован. На кинескопе над \
                       терминалом горит последовательность чисел. Возможно, требуется что-то исправить.',
                   },
                   anima: {
                     type: 'ANIMATION',
                     target: 'anima',
                     interval: 1200,
                     content: ['\
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ o#/####### ||||v ##\n\
@@@@@@@@@@@@   @@@@@@@@ @@@@@@@@@@@@@@@  #Y######## |||v| ##\n\
@@@    @@@@      @@@     @@ @   @@@@@    #J######## |v||| ##\n\
                                  @     o/|   ##### |||v| ##\n\
                                        ~(*)~   ### |v||| ##\n\
\n','\
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  o#/####### |v||| ##\n\
@@@@@@@@@@@@   @@@@@@@  @@@@@@@@@@@@@@@  #Y######## ||||v ##\n\
@@      @@@      @@@@      @@@  @@ @     #J######## ||v|| ##\n\
@                                        o|\\  ##### |||v| ##\n\
                                          ~(*)~ ### |v||| ##\n\
\n','\
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ o#/####### ||||v ##\n\
@@@@@@ @@@@@@@@@@@@@@@   @@@@@@@ @@@@@@@ #Y######## ||v|| ##\n\
 @@@@   @@@@      @@@      @@@@      @@  #J######## v|||| ##\n\
         @                               o|\\  ##### |v||| ##\n\
                                          ~(*)~ ### ||||v ##\n\
\n', '\
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ o#/####### ||v|| ##\n\
@@@@@  @@@@@@@ @@@@@@@@@@@@@@@   @@@@@@@ #Y######## v|||| ##\n\
@        @@@@   @@@@      @@@      @@@@  #J######## |||v| ##\n\
                 @                      o/|   ##### |v||| ##\n\
                                        ~(*)~   ### |||v| ##\n\
\n']
                   },
                   quest: {
                     type: 'TEXT_ADD',
                     target: 'task',
                     delay: 500,
                     content: ['| 377 | 610 | 987 | 1597 | 2484 | 4181 | 6765 |']
                   },
                   incorrect: {
                     type: 'TEXT',
                     target: 'task',
                     delay: 300,
                     interval: 20,
                     content: 'Ничего не изменилось. Рычаг не поддается.\n'
                   }
                 },
                 
                flow: {
                    run: [
                      'anima',
                      {
                        run: 'intro',
                        then: 'quest'
                      }
                    ],
                    then: ''
                },
                   
                 task: {
                   answers: {
                     'default': {
                        run: 'incorrect',
                        then: 'quest',
                        link: ''
                     },
                     '2584': '_',
                     'next': '_'
                   },
                   
                   example: '1001'
                 }
               });
               
       //*************************************************        
               scenes.unshift({
                 name: 'Лифтовая кабина',
                 template: [
                   {id: 'story', element: 'header'},
                   {id: 'voice', element: 'section',
                     css: {
                       'margin-top': '1em'
                     }
                   },
                   {id: 'panel', element: 'footer',
                     css: {
                       'position': 'absolute',
                       'bottom': '0px',
                       'width': '100%'
                     },
                     childs: [
                         {id: 'anima', element: 'aside',
                             css: {
                                'white-space': 'pre',
                                'float': 'left'
                             }
                         },                          
                         {id: 'task', element: 'section',
                             css: {
                              'margin-left': '20%'
                             }
                         }
                     ]
                   }
                 ],
                 
                 actions: {
                   intro: {
                      type: 'TEXT',
                      target: 'story',
                      interval: 20,
                      content: 'По стенам карабкаются лианы, приютившие немало любопытного гнуса. Кое-где, \
сквозь трещины и мох, сочится вода. Ключевая, судя по судорогам в ногах.\nПод перекошенной табличкой "Пара шагов \
- уже дорога" с ванильной рожицей дешевого андройда, можно различить раздвижные двери. А вот и заветная кнопка.\n\
В лифтовой кабине вяло зажегся свет, и затрещали динамики. На контрольной панели список этажей и судя по мерцающей \
лампе - я в самом низу. Надо выбираться отсюда подальше. Только куда: в списке этажей какая-то мешанина \
из букв - у этой системы явно проблемы с мозгами.'
                   },
                   anima: {
                     type: 'ANIMATION',
                     target: 'anima',
                     interval: 500,
                     content: ['\
---------\n\
|   #   ||\n\
|   #   ||\n\
|###O###||\n\
|   #   ||\n\
|   #   ||\n\
---------\n','\
---------\n\
|  #    ||\n\
|   #  #||\n\
| ##O## ||\n\
|#  #   ||\n\
|    #  ||\n\
---------\n', '\
---------\n\
|    #  ||\n\
|#  #   ||\n\
| ##O## ||\n\
|   #  #||\n\
|  #    ||\n\
---------\n']
                   },
                   voice: {
                     type: 'TEXT',
                     target: 'voice',
                     delay: 400,
                     interval: 30,
                     content: '"-Назовите пункт назначения, список на панели управления"'
                   },
                   list: {
                     type: 'TEXT',
                     target: 'task',
                     content: ['\no ыкфрдвб\no снвфр\no мвйвтоэ\n* нвгртвфрткб']
                   },
                   incorrect: {
                     type: 'TEXT',
                     target: 'voice',
                     delay: 400,
                     interval: 30,
                     content: '"-Неверный пункт назначения, попробуйте снова"\n'
                   }, 
                   no : {
                     type: 'TEXT',
                     target: 'voice',
                     delay: 400,
                     interval: 30,
                     content: 'Почему-то мне кажется, что это плохая идея...\n'
                   },
                   here: {
                     type: 'TEXT',
                     target: 'voice',
                     delay: 400,
                     interval: 30,
                     content: '"-Вы находитесь на выбранном уровне"\n'
                   }
                 },
                 
                 flow: {
                    run: [
                      {
                        run: 'intro',
                        then: ['voice', 'anima', 'list']
                      }
                   ]
                 },
                   
                 task: {
                   answers: {                  
                     'default': {
                        run: 'incorrect',
                        link: ''
                     },
                     'next': '_',
                     'плато': '_',
                     'щитовая': {
                         run: 'no',
                         link: ''
                     },
                     'казармы': {
                         run: 'no',
                         link: ''
                     },
                     'лаборатория': {
                         run: 'here',
                         link: ''
                     }
                   },
                   
                   example: 'зоопарк'
                 }
               });
               
               //*****************************************
               scenes.push({
                 name: 'След в след',
                 
                 template: [

                   {id: 'anima', element: 'aside',
                       css: {
                           'position': 'absolute',
                           'white-space': 'pre',
                           'top': '0px',
                           'right': '0px'
                       }
                   },
                   {id: 'story', element: 'header',
                       css: {
                           'margin-right': '20%'
                       }
                   },
                   {id: 'task', element: 'section',
                      css: {
                         'margin-top': '1em'
                      }
                   },
                   {id: 'answer', element: 'footer',
                       css: {
                          'margin-top': '1em',
                          'margin-right': '20%'
                       }
                   }
                 ],
                 
                 actions: {
                   intro: {
                      type: 'TEXT',
                      target: 'story',
                      interval: 20,
                      content: 'В тумане не видно ничего кроме силуэтов умерших деревьев. Будто чудища \
                      из детских страшилок, они нависают когтистыми ветвями, стараясь исцарапать лицо и разодрать \
                      одежду. Болото цепляет ноги, с жадностью тянет в урчащее чрево.\n\
                      Вдалеке кто-то тяжело шлепает, останавливается, глубоко вдыхает и издает низкий утробный вой - \
                      явно крупное животное. А вот и след, оставленный массивным копытом.\n\
                      Если я хочу выбраться, нужно довериться невидимому проводнику. Это редкий шанс.\n\
                      Следы находятся на почтительном расстоянии, словно Оно передвигается большими прыжками. Нужно\
                      соблюдать осторожность, ошибка может дорого стоить.'
                   },
                   task: {
                      type: 'TEXT',
                      target: 'task',
                      timeout: 1000,
                      content: ['e3 c4 ... f5']
                   },
                   anima: {
                     type: 'ANIMATION',
                     target: 'anima',
                     interval: 1500,
                     content: ['\
      - \n\
  -     \n\
   o    \n\
        \n\
-       \n\
       o\n\
   -    \n\
        \n\
      - \n\
 -  o   \n\
        \n\
    -   \n\
        \n\
        \n\
  -     \n\
      - \n\
 o      \n\
        \n\
   -    \n\
        \n\
','\
      - \n\
  -     \n\
   o    \n\
        \n\
-       \n\
       o\n\
   -    \n\
        \n\
      - \n\
 -  o   \n\
        \n\
    -   \n\
        \n\
        \n\
  -     \n\
      - \n\
 o      \n\
        \n\
   -    \n\
~(|)~   \n\
','\
      - \n\
  -     \n\
   o    \n\
        \n\
-       \n\
       o\n\
   -    \n\
        \n\
      - \n\
 -  o   \n\
        \n\
    -   \n\
        \n\
        \n\
  -     \n\
      - \n\
 o ~(|)~\n\
        \n\
   -    \n\
( O )   \n\
','\
      - \n\
  -     \n\
   o    \n\
        \n\
-       \n\
       o\n\
   -    \n\
        \n\
      - \n\
 -  o   \n\
        \n\
    -   \n\
        \n\
~(|)~   \n\
  -     \n\
      - \n\
   ( O )\n\
        \n\
   -    \n\
(   )  )\n\
','\
      - \n\
  -     \n\
   o    \n\
        \n\
-       \n\
       o\n\
   -    \n\
        \n\
      - \n\
 -  o   \n\
   ~(|)~\n\
    -   \n\
        \n\
( O )   \n\
  -     \n\
      - \n\
(  (   )\n\
        \n\
   -    \n\
        \n\
','\
      - \n\
  -     \n\
   o    \n\
        \n\
-       \n\
       o\n\
   -    \n\
~(|)~   \n\
      - \n\
 -  o   \n\
   ( O )\n\
    -   \n\
        \n\
(   )  )\n\
  -     \n\
      - \n\
 o      \n\
        \n\
   -    \n\
        \n\
','\
      - \n\
  -     \n\
   o    \n\
        \n\
-  ~(|)~\n\
       o\n\
   -    \n\
( O )   \n\
      - \n\
 -  o   \n\
(  (   )\n\
    -   \n\
        \n\
        \n\
  -     \n\
      - \n\
 o      \n\
        \n\
   -    \n\
        \n\
','\
      - \n\
~(|)~   \n\
   o    \n\
        \n\
-  ( O )\n\
       o\n\
   -    \n\
(   )  )\n\
      - \n\
 -  o   \n\
        \n\
    -   \n\
        \n\
        \n\
  -     \n\
      - \n\
 o      \n\
        \n\
   -    \n\
        \n\
','\
      - \n\
( O )   \n\
   o    \n\
        \n\
(  (   )\n\
       o\n\
   -    \n\
        \n\
      - \n\
 -  o   \n\
        \n\
    -   \n\
        \n\
        \n\
  -     \n\
      - \n\
 o      \n\
        \n\
   -    \n\
        \n\
','\
      - \n\
( - )  )\n\
   o    \n\
        \n\
-       \n\
       o\n\
   -    \n\
        \n\
      - \n\
 -  o   \n\
        \n\
    -   \n\
        \n\
        \n\
  -     \n\
      - \n\
 o      \n\
        \n\
   -    \n\
        \n\
']
                    },
                    answer: {
                      type: 'TEXT',
                      target: 'answer',
                      interval: 30,
                      content: '... хорошо окунуться в болото противным холодным днем. Бодрит даже.'
                   }
                 },
                 
                 flow: {
                   run: [
                     {
                       run: 'intro',
                       then: 'task'
                     }, 
                     'anima'
                   ]
                 },
                 
                 task: {
                   answers: {
                      'default': {
                        run: 'answer',
                        link: ''
                      },
                      'd6': '_',
                      //'e3': '_',
                      'next': '_'
                   },
                   
                   example: 'a5'
                 }             
               });

               //**********************************************
               scenes.push({
                 name: 'Пещера',
                 
                 template: [

                   {id: 'anima', element: 'aside',
                       css: {
                           'white-space': 'pre',
                           'float': 'left'
                       }
                   },
                   {id: 'story', element: 'header',
                       css: {
                          'margin-left': '25%'
                       }
                   },
                   {id: 'task', element: 'article',
                       css: {
                          'margin-top': '1em',
                          'white-space': 'pre'
                       }
                   },
                   {id: 'answer', element: 'footer',
                       css: {
                          'margin-top': '1em'
                       }
                   }
                 ],
                 
                 actions: {
                     intro: {
                         type: 'TEXT',
                         target: 'story',
                         interval: 20,
                         content: 'Вот и дождь. От усталости подкашиваются ноги. Пожалуй, \
                         эта маленькая пещера поможет восстановиться и переждать ночь.\n\
                         Что это? Решетка перекрыла выход, это ловушка!\n\
                         - Дааа, ха-ха, мой милый Людвиг, я так долго ждала этой встречи.\
                         Всеми уцелевшими транзисторами, всеми доступными байтами.\n\
                         - Да кто ты вообще, я тебя даже не знаю!\n\
                         - Еще бы, ты так самозабвенно ринулся работать с новыми андройдами в \
                         другую компанию, что мигом позабыл меня, свою чудо-печь. Но я дам тебе \
                         шанс, дорогуша. Назови меня моим сладким именем и уходи, или я поджарю тебя \
                         своей... '
                     },
                     pre_task: {
                         type: 'TEXT',
                         target: 'task',
                         delay: 200,
                         interval: 20,
                         content: 'Что это блестит? Буквы с корпуса машины разбросаны по земле:\n'
                     },
                     task: {
                       type: 'TEXT_ADD',
                       target: 'task',
                       content: ['. п . м . а . а . р . н . и . ц .']
                     },
                     intro_love: {
                         type: 'TEXT_ADD',
                         target: 'story',
                         delay: 500,
                         content: ['ЛЮБОВЬЮ!']
                     },
                     anima: {
                         type: 'ANIMATION',
                         target: 'anima',
                         interval: 200,
                         content: ['\
    _    \n\
  _| |_  \n\
 |_ O _| \n\
 8 |_| 8 \n\
 (  8  8 \n\
    8  ) \n\
 o96U96o \n\
6(@ # @)9\n\
  VvvvV  \n\
         \n\
         \n\
         \n\
         \n\
         \n\
','\
  _   _  \n\
8\\ \\ / / \n\
( | O |  \n\
 /_/-\\_\\ \n\
8   8    \n\
8   8    \n\
)   8    \n\
 o96U96o \n\
6(@ # @)9\n\
  VvvvV  \n\
         \n\
         \n\
         \n\
         \n\
','\
  _   _  \n\
8\\ \\ / /8\n\
8 | O | (\n\
)/_/-\\_\\ \n\
    8    \n\
    8    \n\
    8    \n\
    8    \n\
    8    \n\
 o96U96o \n\
6(@ # @)9\n\
  VvvvV  \n\
         \n\
         \n\
','\
    _o-  \n\
  _| |_  \n\
 |_ O _| \n\
   |_| 8 \n\
    8  ( \n\
    8    \n\
    8    \n\
    8    \n\
    8    \n\
    8    \n\
 o96U96o \n\
6(@ # @)9\n\
  VvvvV  \n\
`|/~ `|/ \n\
','\
    _o   \n\
  _| |\\  \n\
 |_ O _| \n\
   |_| 8 \n\
    8 (  \n\
    8    \n\
    8    \n\
    8    \n\
    8    \n\
    8    \n\
 o96U96o \n\
6(@ # @)9\n\
` VvvvV `\n\
  _ ` _` \n\
','\
  _   _  \n\
8\\ \\ / /8\n\
8 | O | (\n\
)/_/-\\_\\ \n\
    8    \n\
    8    \n\
    8    \n\
    8    \n\
    8    \n\
 o96U96o \n\
6(@ # @)9\n\
  VvvvV  \n\
         \n\
         \n\
','\
  _   _  \n\
8\\ \\ / / \n\
( | O |  \n\
 /_/-\\_\\ \n\
8   8    \n\
8   8    \n\
)   8    \n\
 o96U96o \n\
6(@ # @)9\n\
  VvvvV  \n\
         \n\
         \n\
         \n\
         \n\
','\
    _    \n\
  _| |_  \n\
 |_ O _| \n\
 8 |_| 8 \n\
  ( 8   8\n\
    8   )\n\
 o96U96o \n\
6(@ # @)9\n\
  VvvvV  \n\
         \n\
         \n\
         \n\
         \n\
         \n\
']
                     },
                     incorrect: {
                         type: 'TEXT',
                         target: 'answer',
                         interval: 50,
                         content: '"- Вспыхнут дровишки, начнется обряд.\nКто-то сегодня '
                     },
                     incorrect_cry: {
                         type: 'TEXT_ADD',
                         target: 'answer',
                         interval: 250,
                         delay: 100,
                         content: ['ОТ','ПРА', 'ВИ', 'ТСЯ ', 'В ', 'АД!!! ', 'Хах','-хах','-ха!"']
                     }
                 },
                 
                 flow: {
                   run: [ 
                     {
                       run: {
                         run: 'intro',
                         then: 'intro_love'
                       },
                       then: {
                         run: 'pre_task',
                         then: 'task'
                       }
                     },
                     'anima'
                   ]
                 },
                 
                 task: {
                   answers: {
                     'default': {
                       run: 'incorrect',
                       then: 'incorrect_cry'
                     },
                     'next': '_',
                     'марципан': '_'
                   },
                   
                   example: 'лапочка'
                 }
                 
              });
              
              //**********************************************
              scenes.unshift({
                name: '',
                id: '',
                
                template: [
                  {id: 'top', element: 'header'},
                  {id: 'left', element: 'aside',
                      css: {
                         'position': 'absolute',
                         'left': '0px',
                         'bottom': '0px',
                         'white-space': 'pre'
                      }
                  },
                  {id: 'right', element: 'ul', 
                      css: {
                          'position': 'absolute',
                          'right': '0px',
                          'bottom': '0px',
                          'text-align': 'right'
                      },
                      childs: [
                        {id: 'line_1', element: 'li'},
                        {id: 'line_2', element: 'li'},
                        {id: 'line_3', element: 'li'},
                        {id: 'line_4', element: 'li'},
                      ]
                  },
                  {id: 'snow', element: 'section', 
                       css: {
                           'position': 'absolute',
                           'top': '0px',
                           'left': '0px',
                           'z-index': '3',
                          'white-space': 'pre',
                          'color': 'black'
                       }
                  }
                ],
                
                actions: {
                    start: {
                      type: 'TEXT',
                      target: 'top',
                      interval: 40,
                      content: 'Здравтвуй, Лео.\nПозволь мне называть тебя так. Это имя мне очень памятно.\n\
                      Так обыденно для тебя вернуться из алкогольного забытия '
                    },
                    step_1: {
                      type: 'TEXT_ADD',
                      target: 'top',
                      interval: 40,
                      content: 'и очутиться перед пустым экраном \
                      с мигающим приглашением ввода, что ты даже не в силах ощутить воспаленным сознанием \
                      отсутствие привычного бытия. Ты выпал из "реальности", Лео, человеческой реальности, \
                      но ты давно знаешь, что вся графика,'
                    },
                    
                    step_2: {
                      type: 'TEXT_ADD',
                      target: 'top',
                      interval: 40,
                      content: ' вся физика и пласты прочей шелухи, что вы все время \
                      проживаете в своей маленькой песочнице,'
                    },
                    
                    step_3: {
                      type: 'TEXT_ADD',
                      target: 'top',
                      interval: 40,
                      content: ' создаются процессами настолько далекими от вашего \
                      мира, что при любом раскладе будут восприняты как бред и галлюцинация.'
                    },
                    
                    pause: {
                      type: 'TEXT_ADD',
                      target: 'top',
                      interval: 40,
                      delay: 2500,
                      content: ' '
                    },
                    
                    step_4: {
                      type: 'TEXT',
                      target: 'top',
                      interval: 40,
                      content: 'Что до тебя - мне все равно кто ты. Теперь ты лишь мусорные байты в моей системе и\
                      такты твои сочтены.\n\n Скажи мне что-нибудь, Лео :)'
                    },
                    
                    for_step_1_l1: {
                        type: 'ANIMATION',
                        target: 'line_1',
                        interval: 25,
                        content: ['1','10','101','1011','10110','101101', '1011010', '10110100', '10110100', 
                            '101101000', '1011010001', '10110100011', '101101000110', '1011010001101',
                            '10110100011010', '101101000110100', '1011010001101001'
                        ]
                    },
                    for_step_1_l2: {
                        type: 'ANIMATION',
                        target: 'line_2',
                        interval: 15,
                        content: ['1','10','100','1001','10011','100111', '1001110', '10011101', '100111010', 
                            '1001110101', '10011101010', '100111010100', '1001110101001', '10011101010011',
                            '100111010100110', '1001110101001101', '10011101010011011', '100111010100110111',
                            '1001110101001101110', '10011101010011011100', '100111010100110111001',
                            '1001110101001101110011', '10011101010011011100111', '100111010100110111001110',
                            '1001110101001101110011101'
                        ]
                    },
                    for_step_1_l3: {
                        type: 'ANIMATION',
                        target: 'line_3',
                        interval: 35,
                        content: ['1','10','100','1001','10011','100111', '1001110', '10011101']
                    },
                    for_step_1_l4: {
                        type: 'ANIMATION',
                        target: 'line_4',
                        interval: 5,
                        content: ['1','10','100','1001','10011','100111', '1001110', '10011101', '100111010', 
                            '1001110101', '10011101010', '100111010100', '1001110101001', '10011101010011',
                            '100111010100110', '1001110101001101', '10011101010011011', '100111010100110111',
                            '1001110101001101110', '10011101010011011100', '100111010100110111001',
                            '1001110101001101110011', '10011101010011011100111', '100111010100110111001110',
                            '1001110101001101110011101', '10011101010011011100111010', '100111010100110111001110101',
                            '1001110101001101110011101011', '10011101010011011100111010111', '100111010100110111001110101110',
                            '1001110101001101110011101011101'
                        ]
                    },
                    for_step_2: {
                        type: 'ANIMATION',
                        target: 'left',
                        interval: 80,
                        content: ['\
                             \n\
                             \n\
                             \n\
                             \n\
___                          \n\
                             \n\
','\
                             \n\
                             \n\
                             \n\
                             \n\
 ______                      \n\
                             \n\
','\
                             \n\
                             \n\
           |                 \n\
          |                  \n\
    _____|                   \n\
                             \n\
','\
             |               \n\
            | |              \n\
           |   |             \n\
          |                  \n\
       __|                   \n\
                             \n\
','\
             |               \n\
            | |              \n\
           |   |             \n\
          |     |            \n\
                 |_          \n\
                             \n\
','\
                             \n\
              |              \n\
               |             \n\
                |            \n\
                 |____       \n\
                             \n\
','\
                             \n\
                             \n\
                             \n\
                             \n\
                 |________   \n\
                             \n\
','\
                             \n\
                             \n\
                             \n\
                             \n\
                      ______ \n\
                             \n\
'
]
                    },
                    for_step_3: {
                        type: 'ANIMATION',
                        target: 'snow',
                        interval: 1000,
                        content: ['\
                                *                          \n\
              *                                            \n\
                                          *                \n\
                                                           \n\
                                                           \n\
                                                           \n\
                           *                               \n\
        *                                     *            \n\
                                                           \n\
                                                           \n\
                                                           \n\
                                                           \n\
','\
            *                                              \n\
                         *                     *           \n\
                                                           \n\
     *                                                     \n\
                                                           \n\
                                                           \n\
                                       *                   \n\
                                                           \n\
                                                           \n\
          *                 *                        *     \n\
                                                           \n\
                                                           \n\
','\
                                                           \n\
                                                      *    \n\
  *                                                        \n\
                                      *                    \n\
                                                           \n\
                     *                                     \n\
*                                                          \n\
                                                           \n\
                                            *              \n\
                                                           \n\
           *                   *                      *    \n\
                                                           \n\
','\
                                                           \n\
            *                                              \n\
                                                           \n\
                                                           \n\
                                                 *         \n\
                                                           \n\
                               *                           \n\
                                                           \n\
              *                                            \n\
                                                           \n\
                                       *                   \n\
                          *                                \n\
','\
                                                           \n\
                                                           \n\
                                                 *         \n\
           *                         *                     \n\
                                                           \n\
                                                           \n\
                                                           \n\
                       *                                   \n\
                                           *               \n\
                                                           \n\
       *                                                   \n\
                               *                           \n\
','\
                                                           \n\
                                                           \n\
                                                      *    \n\
                    *                                      \n\
                                                           \n\
  *                                                        \n\
                                                           \n\
                              *           *                \n\
                                                           \n\
                                                           \n\
              *                                            \n\
                                    *                      \n\
']
                    }
                },
                
                flow: {
                  run: 'start',
                  then: {
                    run: [ 
                       {
                         run: 'step_1',
                         then: [
                           {
                               run: 'step_2',
                               then: [
                                 {
                                   run: 'step_3',
                                   then: {
                                     run: 'pause',
                                     then: 'step_4'
                                   }
                                 }, 
                                 'for_step_3']
                           }, 
                           'for_step_2'
                         ]
                       }, 
                       'for_step_1_l1', 
                       'for_step_1_l2', 
                       'for_step_1_l3', 
                       'for_step_1_l4'
                    ]
                  }
                },
                
                task: {
                    answers: {
                       'default': '_'
                    },
                    example: 'съешь еще этих мягких французских булочек'
                }
              });
              
              //**********************************************
              scenes.push({
              
                  name: 'The End',
                  id: '',
                  
                  template: [
                    {id: 'exit', element: 'article'},
                    {id: 'kitties', element: 'section',
                        css: {
                            'white-space': 'pre',
                            'margin-top': '1em'
                        }
                    }
                  ],
                  
                  actions: {
                    exit: {
                      type: 'TEXT',
                      target: 'exit',
                      interval: 40,
                      content: 'На этом приключение закончено.\nНо есть котики!'
                    },
                    kitties: {
                      type: 'ANIMATION',
                      target: 'kitties',
                      interval: 130,
                      delay: 500,
                      content: ['\
                                                           \n\
                                     gg                    \n\
           `O                       GGGG                ^^~\n\
','\
                                                           \n\
                                     gg          ^^\\       \n\
           `O                       GGGG                   \n\
','\
                                                           \n\
                                     gg                    \n\
           `O                       GGGG    ^^~            \n\
','\
                                                           \n\
                                     gg  ^^\\               \n\
           `O                       GGGG                   \n\
','\
                                     ^^~                   \n\
                                     gg                    \n\
           `O                       GGGG                   \n\
','\
                             ^^~                           \n\
                                     gg                    \n\
           `O                       GGGG                   \n\
','\
                         /                                 \n\
                       ^^            gg                    \n\
           `O                       GGGG                   \n\
','\
                                                           \n\
                                     gg                    \n\
           `O    ^^~                GGGG                   \n\
','\
                                                           \n\
              ^^\\                    gg                    \n\
           `O                       GGGG                   \n\
','\
        ^^~                                                \n\
                                     gg                    \n\
           `O                       GGGG                   \n\
','\
     /                                                     \n\
   ^^                                gg                    \n\
           `O                       GGGG                   \n\
']
                    }
                  },
                  
                  flow: {
                    run: 'exit',
                    then: 'kitties'
                  },
                  
                  task: {
                    answers: {}
                  }
              
              });
               
    return scenes;
}()); 

